use [Туристическая фирма]
go

insert into Касса
([ID сотрудника • Касса],[ID клиента • Касса], Сумма,[Валюта • Касса], Дата, [Код тура • Касса])
values
(1, 1, 190667, 1, '2021-04-02', 1),
(2, 2, 438577, 1, '2021-04-12', 2),
(2, 3, 361966, 1, '2021-04-23', 3),
(1, 4, 108891, 1, '2021-05-04', 4),
(1, 5, 326120, 1, '2021-05-21', 6),
(3, 6, 486000, 1, '2021-05-26', 7),
(3, 7, 45000, 2, '2021-06-02', 8),
(3, 8, 2500, 3, '2021-06-09', 9),
(4, 9, 564687, 1, '2021-06-15', 10),
(1, 10, 4500, 3, '2021-06-17', 11),
(4, 11, 65400, 2, '2021-06-24', 12),
(1, 12, 190667, 1, '2021-07-05', 1),
(2, 13, 438577, 1, '2021-07-08', 2),
(1, 14, 365400, 1, '2021-07-09', 13),
(1, 15, 21360, 2, '2021-07-29', 14),
(3, 16, 4100, 3, '2021-08-03', 15),
(2, 17, 256400, 1, '2021-08-18', 16),
(3, 18, 657240, 1, '2021-08-26', 17),
(1, 19, 241540, 1, '2021-08-27', 18),
(4, 20, 4230, 3, '2021-08-31', 19),
(4, 21, 12450, 2, '2021-08-09', 20)

select 
	toClient.[ID identity cards] as 'ID клиента',
	toClient.Фамилия, toClient.Имя, toClient.Отчество,
	Туры.наименование as 'Туры',
	Касса.Сумма, Валюта.Валюта,
	Касса.Дата,
	toStuffs.[ID identity cards] as 'ID сотрудника',
	toStuffs.Фамилия, toStuffs.Имя
from Касса 
join Клиенты on
Клиенты.[ID клиента] = Касса.[ID клиента • Касса]
join Сотрудники on
Сотрудники.[ID сотрудники] = Касса.[ID сотрудника • Касса]
inner join [Удостоверения личности] toClient on
toClient.[ID identity cards] = Клиенты.[Номер уд.личности]
inner join [Удостоверения личности] toStuffs on
toStuffs.[ID identity cards] = Сотрудники.[ФИО • Сотрудники]
right join Туры on
Туры.[ID туры] = Касса.[Код тура • Касса]
right join Валюта on
Валюта.[ID валюты] = Касса.[Валюта • Касса]

