use [Туристическая фирма]
go

insert into Услуги
(наименование)
values
('Экскурсионные туры.'),
('Лечебные туры.'),
('VIP-отдых.'),
('Экзотические туры.'),
('Пляжные туры.'),
('Горнолыжный туризм.'),
('Детский отдых.'),
('Бизнес-туры. '),
('Обучение за рубежом.'),
('Бронирование авиа билетов.'),
('Визовая поддержка.'),
('Поиск горящих туров.'),
('Таксив Аэропорт.'),
('Оформление визы.'),
('Корпоративное обслуживание.'),
('Бронирование отелей и гостиниц.'),
('Бронирование авиабилетов.'),
('Бронирование отелей.')

select * from Услуги