use [Туристическая фирма]
go

insert into Договора
([ID клиента • Договора],[ID сотрудника • Договора], 
					[ID тура • Договора], [дата начала тура])
VALUES
(1, 1, 1, '2021-04-02'),
(2, 2, 2, '2021-04-12'),
(3, 2, 3, '2021-04-23'),
(4, 1, 4, '2021-05-04'),
(5, 1, 6, '2021-05-21'),
(6, 3, 7, '2021-05-26'),
(7, 3, 8, '2021-06-02'),
(8, 3, 9, '2021-06-09'),
(9, 4, 10, '2021-06-15'),
(10, 1, 11, '2021-06-17'),
(11, 4, 12, '2021-06-24'),
(12, 1, 1, '2021-07-05'),
(13, 2, 2, '2021-07-08'),
(14, 1, 13, '2021-07-09'),
(15, 1, 14, '2021-07-29'),
(16, 3, 15, '2021-08-03'),
(17, 2, 16, '2021-08-18'),
(18, 3, 17, '2021-08-26'),
(19, 1, 18, '2021-08-27'),
(20, 4, 19, '2021-08-31'),
(21, 4, 20, '2021-08-09')

select 
	Договора.[ID договора],
	Туры.наименование as 'Туры',
	Договора.[дата начала тура] as 'Дата начала тура',
	(dateadd(WEEK, 2 , [дата начала тура])) 
	as 'Дата окончания тура',
	Клиент.[ID identity cards] as 'ID клиента',
	Клиент.Фамилия, Клиент.Имя, Клиент.Отчество,
	Сотрудник.[ID identity cards] as 'ID сотрудника'
	--Сотрудник.Фамилия, Сотрудник.Имя
from Договора 
join Клиенты on 
Клиенты.[ID клиента] = Договора.[ID клиента • Договора]
join Сотрудники on
Сотрудники.[ID сотрудники] = Договора.[ID сотрудника • Договора]
inner join [Удостоверения личности] Клиент on
Клиент.[ID identity cards] = Клиенты.[Номер уд.личности]
inner join [Удостоверения личности] Сотрудник on
Сотрудник.[ID identity cards] = Сотрудники.[ФИО • Сотрудники]
inner join Туры on
Туры.[ID туры] = Договора.[ID тура • Договора]