use [Туристическая фирма]
go

insert into [Договор услуга]
([ID договора • Договор услуга], [ID услуги • Договор услуга])
values
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 5),
(7, 3),
(8, 4),
(9, 7),
(10, 9),
(11, 2),
(12, 2),
(13, 1),
(14, 3),
(15, 4),
(16, 3),
(17, 3),
(18, 7),
(19, 9),
(20, 5),
(21, 5)

select
	[ID договора • Договор услуга] as 'ID',
	Туры.наименование as 'Туры', Страна,
	цена as 'Стоимость',
	Валюта.Валюта, Договора.[дата начала тура]
	as 'Дата начала',
	(DATEADD(WEEK, 2, [дата начала тура])) as 'Дата окончания',
	--[ID услуги • Договор услуга] as 'ID',
	Услуги.наименование as 'Услуги туристических агентств'
	--Сотрудники.[ФИО • Сотрудники] as 'Сотрудник',
	--[Удостоверения личности].Фамилия, 
	--[Удостоверения личности].Имя
from [Договор услуга]
join Договора on
Договора.[ID договора] = [Договор услуга].[ID договора • Договор услуга]
join Услуги on
Услуги.[ID услуги] = [Договор услуга].[ID услуги • Договор услуга]
inner join Туры on
Туры.[ID туры] = Договора.[ID тура • Договора]
right join [Страны (по ISO 3166)] on
[Страны (по ISO 3166)].[ID страны] =
	Туры.[Страна • Туры]
right join Валюта on
Валюта.[ID валюты] = Туры.[Валюта • Туры]
inner join Сотрудники on 
Сотрудники.[ID сотрудники] = Договора.[ID сотрудника • Договора]
inner join [Удостоверения личности] on
[Удостоверения личности].[ID identity cards] = Сотрудники.[ФИО • Сотрудники]

