use [Туристическая фирма]
go

select * from Договора

insert into Ваучер
([ID клиента • Ваучер], Дата, [Направление • Ваучер])
values
( 1, '2021-04-02', 1),
( 2, '2021-04-12', 2),
( 3, '2021-04-23', 3),
( 4, '2021-05-04', 4),
( 5, '2021-05-21', 6),
( 6, '2021-05-26', 7),
( 7, '2021-06-02', 8),
( 8, '2021-06-09', 9),
( 9, '2021-06-15', 10),
(10, '2021-06-17', 11),
(11, '2021-06-24', 12),
(12, '2021-07-05', 1),
(13, '2021-07-08', 2),
(14, '2021-07-09', 13),
(15, '2021-07-29', 14),
(16, '2021-08-03', 15),
(17, '2021-08-18', 16),
(18, '2021-08-26', 17),
(19, '2021-08-27', 18),
(20, '2021-08-31', 19),
(21, '2021-08-09', 20)

select 
	[ID ваучер] as ID,
	Фамилия, Имя, Отчество,
	Клиенты.[Номер телефона], 
	Туры.наименование 
	as 'Направление • Ваучер', Дата, Комментарий 
from Ваучер
right join Клиенты on
Клиенты.[ID клиента] = Ваучер.[ID клиента • Ваучер]
inner join [Удостоверения личности] on
Клиенты.[Номер уд.личности] = [Удостоверения личности].[ID identity cards]
inner join Туры on
Туры.[ID туры] = Ваучер.[Направление • Ваучер]
