use [Туристическая фирма]
go

insert into [Удостоверения личности]
([ID identity cards], Фамилия, Имя, Отчество, [Пол • Удостоверения личности],
[Дата рождения],ИИН,[дата выдачи удостоверения])
values
(950155, 'Жолтаева', 'Ризада', 'Ергашовна',			2, '1970-03-27', 700327301456, '2018-01-25'),
(826341, 'Баянова', 'Динара', 'Даулетовна',			2, '1985-04-10', 850410300741, '2013-08-06'),
(592556, 'Темешев', 'Нариман', 'Муратович',			1, '1980-05-05', 800505400852, '2014-12-21'),
(482403, 'Аманжов', 'Мейржан', 'Дарханвич',			1, '1985-01-15', 850115302963, '2012-06-20'),
(823191, 'Омирбеков', 'Темирбек', 'Омарович',		1, '1995-03-30', 950330300987, '2010-10-08'),
(751579, 'Камбарулы', 'Ергашбай', null,				1, '1983-03-25', 830325401654, '2014-12-23'),
(289890, 'Жолтаева', 'Фейрузада', 'Маликовна',		2, '1985-11-28', 851128400321, '2012-05-25'),
(224787, 'Бакытжан', 'Ералы', 'Медетович',			1, '1986-06-16', 860616300159, '2011-01-19'),
(496198, 'Бакытжан', 'Ерасыл', 'Медетович',			1, '1991-09-12', 910912303753, '2010-01-08'),
(358859, 'Агаев', 'Нефтулла', 'Мишуллиевич',		1, '1992-10-20', 921020300862, '2010-05-07'),
(515610, 'Жумабаев', 'Канат', 'влалоааоевич',		1, '1993-06-24', 930624300842, '2010-09-05'),
(826352, 'Кабесова', 'Сандугаш', 'Есеновна',		2, '1986-10-20', 861020302624, '2011-05-18'),
(979808, 'Искакулы', 'Mухамедалим', null,			1, '1996-03-20', 960320500248, '2010-07-29'),
(993107, 'Саданова', 'Бахытгуль', 'Маратовна',		2, '1993-01-29', 930129301486, '2016-11-02'),
(895051, 'Агаев', 'Нефтулла', 'Мишуллиевич',		1, '1984-08-11', 840811304862, '2013-01-22'),
(584470, 'Кисина', 'Mира', 'Каиржановна',			2, '1988-05-23', 880523300865, '2012-08-23'),
(129092, 'Досжан', 'Ботакоз', 'Ардашеркызы',		2, '1977-09-08', 770908301845, '2015-09-15'),
(916433, 'Мусин', 'Руслан', 'Бакытович',			1, '1976-11-16', 761116300625, '2010-05-29'),
(939178, 'Баксиков', 'Саят', 'Саясатовия',			1, '1977-02-07', 770207302425, '2011-02-01'),
(706792, 'Забихуллина', 'Баршагуль', 'Абайкызы',	2, '1982-05-27', 820527303325, '2012-06-22'),
(889235, 'Михан', 'Гульнур', 'Нурланкызы',			2, '1983-10-01', 831001302254, '2014-10-05'),
(411364, 'Бакытжан', 'Ясмина', 'Миржановна',		2, '1989-04-19', 890419301745, '2016-08-30'),
(228542, 'Бакытжан', 'Милана', 'Миржановна',		2, '1989-11-07', 891107300896, '2015-02-08'),
(879664, 'Бозкен', 'Мольдир', 'Русланкызы',			2, '1982-09-27', 820927301521, '2013-08-30'),
(517160, 'Жексенбаева', 'Зарина', 'Радиковна',		2, '1981-05-13', 810513300541, '2015-10-05'),
(836607, 'Гайсина', 'Райгуль', 'Кайратовна',		2, '1991-03-21', 910321304125, '2011-11-30')

select  
	[ID identity cards],
	Фамилия, Имя, Отчество, Пол.пол,
	[Дата рождения], ИИН,
	[дата выдачи удостоверения] as 'Дата выдачи',
	(DATEADD(YEAR, 10, [дата выдачи удостоверения])) as 'Срок действия'

from [Удостоверения личности]
right join Пол on
Пол.[ID пол] = [Удостоверения личности].[Пол • Удостоверения личности]
