use [Туристическая фирма]


insert into Клиенты([Номер уд.личности], [Номер телефона])
values
(129092,87024567856),
(224787,87076521578),
(228542,87029854785),
(289890,87017854265),
(358859,87751212458),
(411364,87019865215),
(482403,87088954786),
(496198,87077854412),
(515610,87029856321),
(517160,87018745896),
(584470,87017854128),
(592556,87076524521),
(706792,87027458985),
(916433,87777849865),
(895051,87751474788),
(889235,87787858526),
(879664,87017485526),
(836607,87029857452),
(826352,87087854578),
(826341,87084524152),
(751579,87717418529)--


select
ИИН as 'ИИН клиента', Фамилия, Имя, Отчество,
Пол.пол, [Дата рождения], [Номер телефона] 
from Клиенты inner join [Удостоверения личности] on
[Удостоверения личности].[ID identity cards] = Клиенты.[Номер уд.личности]
right join Пол on
Пол.[ID пол] = [Удостоверения личности].[Пол • Удостоверения личности]



